/*******************************************************************************
devzDDM.c

Device support for the BNL Multi-element germanium detector based on MARS 
electronics
D. P. Siddons
********************************************************************************
1.0  3/24/2017  dps     first ZynQ implementation
*******************************************************************************/

#include        <epicsVersion.h>

#if EPICS_VERSION < 3 || (EPICS_VERSION==3 && EPICS_REVISION < 14)
#define NOT_YET_OSI
#endif

#ifdef HAS_IOOPS_H
#include        <basicIoOps.h>
#endif

#include	<zmq.h>
#include	<stdio.h>
#include        <stdlib.h>
#include        <stdio.h>
#include 	<stdarg.h>
#include 	<stdint.h>
#include	<signal.h>
#include 	<unistd.h>
#include	<fcntl.h>
#include	<sys/mman.h>
#include        <epicsTimer.h>
#include        <epicsThread.h>
#include        <epicsExport.h>
#include	<registryFunction.h>
#include	<iocsh.h>

epicsTimerQueueId       zDDMWdTimerQ=0;
epicsTimerQueueId       TPgenTimerQ=0;


#include	<string.h>
#include	<math.h>

#include	<alarm.h>
/* #include	<dbRecType.h>  tmm: EPICS 3.13 */
#include	<dbDefs.h>
#include	<dbAccess.h>
#include	<dbCommon.h>
#include	<dbScan.h>
#include	<dbEvent.h>
#include        <recGbl.h>
#include	<recSup.h>
#include	<devSup.h>
/*#include	<drvSup.h> */
#include	<dbScan.h>
#include	<special.h>
#include        <callback.h>
#include	<epicsInterrupt.h>
#include	<errlog.h>
#include 	<iocsh.h>
#include	<epicsExport.h>

   //rdback = fpgabase[FIFOCNTRLREG];
   rdback=pl_register_read(fd,FIFOCNTRLREG);
   
   newval = rdback | 0x1;
   //fpgabase[FIFOCNTRLREG] = newval;
   pl_register_write(fd,FIFOCNTRLREG,newval);
   
   FASTUNLOCK(&fpga_write_lock);


}

/*****************************************
* fifo_disable 
*  FIFO Control Register
*     bit 0 = enable 
*     bit 1 = testmode
*     bit 2 = rst 
******************************************/
void fifo_disable()
{
   int rdback, newval;
   FASTLOCK(&fpga_write_lock);
   
   /* read current value of register */
   //rdback = fpgabase[FIFOCNTRLREG];
   rdback=pl_register_read(fd,FIFOCNTRLREG);
   newval = rdback & 0x60;
   //fpgabase[FIFOCNTRLREG] = newval;
   pl_register_write(fd,FIFOCNTRLREG,newval);
   
   FASTUNLOCK(&fpga_write_lock);
}


/****************************************** 
* fifo reset
*  FIFO Control Register
*     bit 0 = enable 
*     bit 1 = testmode
*     bit 2 = rst 
******************************************/
void fifo_reset()
{
   int rdback, newval;
   FASTLOCK(&fpga_write_lock);
   /* read current value of register */
   //rdback = fpgabase[FIFOCNTRLREG];
   rdback=pl_register_read(fd,FIFOCNTRLREG);
   newval = rdback | 0x4;
   /* set reset high */
   //fpgabase[FIFOCNTRLREG] = newval;
   pl_register_write(fd,FIFOCNTRLREG,newval);
   /* set reset low */
   newval = rdback & 0x3;
   //fpgabase[FIFOCNTRLREG] = newval;
   pl_register_write(fd,FIFOCNTRLREG,newval);
   FASTUNLOCK(&fpga_write_lock);
}

/*****************************************
* check_framestatus 
*    Check is frame is Active
******************************************/
int check_framestatus()
{
   /* read current value of register */
   return pl_register_read(fd,FRAMEACTIVEREG);
   //fpgabase[FRAMEACTIVEREG];

}

/*****************************************
* get_framenum 
*   Read the current frame Number
*   Framenumber is incremented by FPGA at end of frame
* 
******************************************/
int get_framenum()
{
   /* read current value of register */
   return pl_register_read(fd,FRAMENUMREG); 
   //fpgabase[FRAMENUMREG];

}


/*****************************************
* get_framelen 
*   Read the current frame length 
*   Counter is 25MHz, so 40ns period 
* 
******************************************/
float get_framelen()
{
   /* read current value of register */
   return (float) pl_register_read(fd,FRAMELENREG)/ 25000000.0;
   //fpgabase[FRAMELENREG]
}


/*****************************************
* fifo_numwords 
*  Reads back number of words in fifo 
******************************************/
int fifo_numwords()
{
    return pl_register_read(fd,FIFORDCNTREG);
    //fpgabase[FIFORDCNTREG];
}


/*****************************************
* fifo_getdata  
*  Reads data in FIFO 
******************************************/
int fifo_getdata(int len, int *data)
{

   int i;
   for (i=0;i<len;i++) {
      data[i] = pl_register_read(fd,FIFODATAREG);
      //fpgabase[FIFODATAREG];
   }
   return 0;
}


EPICSTHREADFUNC event_publish (struct zDDMRecord *psr)
{

    int i, chipnum, channel, pd, td, ts, ts_prev;
    int numwords, prevframestat, framestat, pxl;
    float evtrate, framelen;
    unsigned int *mca, *tdc, *spct, *intens;
    int monch;
    unsigned int intensity[384];
    printf("Starting Data Thread...\n");
    framestat = 0;
    evttot = 0;
    mca=psr->pmca;
    tdc=psr->ptdc;
    spct=psr->pspct; 
    monch=psr->monch;
    intens=psr->pintens;

    while (1) {
        monch=psr->monch;
        prevframestat = framestat;
        framestat = check_framestatus(); 
        //printf("PrevFrameStat=%d\tFrameStatus=%d\n",prevframestat,framestat); 
        if (framestat == 1) {
           if ((prevframestat == 0) && (framestat == 1))           
              printf("Frame Started...\n"); 
           numwords = fifo_numwords();
           if (numwords > 0) {
              if (numwords > 10000)
                printf("Event Rate kinda too high...   Numwords in FIFO: %d\n",numwords);
              fifo_getdata(numwords,databuf); 
              evttot += numwords/2; 
              if (dbg_lvl == 1) { 
                 for (i=0;i<numwords;i=i+2) { 
                  //newaddr = lkuptbl[addr];
		  //databuf[i] = (databuf[i] & ~0x7FC00000) | (newaddr << 22);
                  chipnum = (databuf[i] & 0x78000000) >> 27;
                  channel = (databuf[i] & 0x07C00000) >> 22;                  
                  pd = (databuf[i] & 0xFFF);
                  td = (databuf[i] & 0x3FF000) >> 12; 
                  ts_prev = ts;
                  ts = (databuf[i+1] & 0x1FFFFFFF);
		  pxl=32*chipnum+channel;
		  intens[pxl]+=1;
		  mca[pxl*4096+pd]+=1;
		  tdc[pxl*1024+td]+=1;
		  if(devzDDMdebug>=6){
                   if (ts > ts_prev + 19){
                    printf("\n");
		    }
	 	    printf("ASIC: %4d   Chan: %4d   PD: %4d   TD: %4d   Timestamp: %d\n",chipnum,channel,pd,td,ts);
			}
                  }
              }
           }
        }
        else
            if ((prevframestat == 1) && (framestat == 0)) {          
                printf("Frame Complete...\n");
                framelen = get_framelen(); 
                evtrate = evttot / framelen;
		for(i=0;i<4096;i++){
		   spct[i]=mca[monch*4096+i];
		   }
               if(devzDDMdebug>=6){ 
                printf("Total Events in Frame=%d\t Rate=%.1f\n",evttot,evtrate);
		}
                evttot = 0; 
       }
        	
	usleep(1000);

    }   
}




/***************************************************
* initialize all software and hardware
* zDDM_init()
****************************************************/

STATIC long zDDM_init(int after)
{

	Debug(2,"zDDM_init(): entry, after = %d\n\r", after);
	if (after) return(0);
	FASTLOCKINIT(&fpga_write_lock);
	FASTLOCKINIT(&SPI_lock);
#ifndef SIMUL
	//mmap_fpga();
#endif
#ifndef SIMUL
       if (pl_open(&fd)==-1){
	   printf("Can't open device\n");
           }
       printf("/dev/vipic opened OK: %i\n",fd);
       signal(SIGIO, &frame_done); 
       fcntl(fd, F_SETOWN, getpid());
       int oflags = fcntl(fd, F_GETFL);
       fcntl(fd, F_SETFL, oflags | FASYNC); 
#endif

	zDDM_state.card_exists = 1;
	printf("Hardware init.\n");
	Debug(3,"zDDM_init: Total cards = %d\n\n\r",1);

	if (zDDM_shutdown() < 0)
		errlogPrintf ("zDDM_init: zDDM_shutdown() failed\n\r"); 

        zDDMWdTimerQ=epicsTimerQueueAllocate(
				1, /* ok to share queue */
				epicsThreadPriorityLow);
        TPgenTimerQ=epicsTimerQueueAllocate(
				1, /* ok to share queue */
				epicsThreadPriorityLow);
	
 	Debug0(3,"zDDMWdTimerQ created\n\r");

        FASTLOCK(&fpga_write_lock);
	
	ad9252_cnfg(1,22,8); /* clock skew adjust */
	ad9252_cnfg(1,255,1); /* latch regs */
	ad9252_cnfg(2,22,8); /* clock skew adjust */
	ad9252_cnfg(2,255,1); /* latch regs */
	ad9252_cnfg(3,22,8); /* clock skew adjust */
	ad9252_cnfg(3,255,1); /* latch regs */
	//fpgabase[MARS_RDOUT_ENB]=0x8aaa; /* Enable all ASIC outputs to FPGA */
        pl_register_write(fd,MARS_RDOUT_ENB,0x8aaa);	
	FASTUNLOCK(&fpga_write_lock);
	Debug(3,"zDDM_init: zDDM %i initialized\n\r",0);
	return(0);
}

/***************************************************
* zDDM_init_record()
****************************************************/
STATIC long zDDM_init_record(struct zDDMRecord *psr, CALLBACK *pcallback)
{
	int channels;
	char thread_name[32];
	
	Debug(5,"zDDM_init_record: card %d\n\r", 0);

	/* inp must be an VME_IO */
	switch (psr->inp.type)
	{
	case (VME_IO) : break;
	default:
		recGblRecordError(S_dev_badBus,(void *)psr,
			"devzDDM (init_record) Illegal OUT Bus Type");
		return(S_dev_badBus);
	}

	Debug(5,"VME zDDM: card %d\n", 0);
	if (!zDDM_state.card_exists)
	{
		recGblRecordError(S_dev_badCard,(void *)psr,
		    "devzDDM (init_record) card does not exist!");
		return(S_dev_badCard);
	}

	if (zDDM_state.card_in_use)
	{
		recGblRecordError(S_dev_badSignal,(void *)psr,
		    "devzDDM (init_record) card already in use!");
		return(S_dev_badSignal);
	}

	zDDM_state.card_in_use = 1;
	sscanf(psr->inp.value.vmeio.parm, "%d", &channels);
	
	printf("devzDDM: channels=%d  zDDM_NCHAN=%d\n",channels, zDDM_NCHAN);
	
	if(channels != zDDM_NCHAN)
	{
		recGblRecordError(S_dev_badSignal,(void *)psr,
		    "devzDDM: Wrong number of channels!");
		return(S_dev_badSignal);
	}
	psr->nch = channels;
	zDDM_state.num_channels = channels;
	zDDM_state.tp = psr->tp;
	zDDM_state.psr = psr;
        Debug(2, "scaler_init_record(): entry %d\n\r", 1);
        devPVT *dpvt;
        dpvt = callocMustSucceed(1, sizeof(devPVT), "devzDDM init_record()");
        dpvt->exists=1;
        dpvt->done=0;
        dpvt->newdat=0;
        dpvt->pcallback=pcallback; 
        psr->dpvt=dpvt;
        dpvt->psr=psr;

/* Set up timer interrupt service routine */
#ifndef SIMUL
//       if (pl_open(&fd)==-1){
//	       printf("Can't open device\n");
//	       }
//       printf("/dev/vipic opened OK: %i\n",fd);
//       signal(SIGIO, &frame_done); 
//       fcntl(fd, F_SETOWN, getpid());
//       int oflags = fcntl(fd, F_GETFL);
//       fcntl(fd, F_SETFL, oflags | FASYNC); 
#endif
 
/* Set up thread to accumulate spectra */
       sprintf(thread_name,"Spectra_%i",1);
       epicsThreadCreate(thread_name,epicsThreadPriorityHigh,
           epicsThreadGetStackSize(epicsThreadStackMedium),
           (EPICSTHREADFUNC)event_publish,psr);		
return(0);
}


STATIC long zDDM_arm(struct zDDMRecord *pscal, int val)
{    
unsigned int *intens;
int i;
extern int zDDM_NCHAN;
  intens=pscal->pintens;
  Debug(2, "scaler_arm(): entry, val = %d\n\r", val); 
  if(pscal->mode==0){
    FASTLOCK(&fpga_write_lock);
	if(val==1){
	   fifo_disable();/* disable fifo */
	   fifo_reset(); /* reset it */
	   for(i=0;i<zDDM_NCHAN;i++){
	     intens[i]=0;
	     }
	     pscal->runno=pl_register_read(fd,FRAME_NO);
	     //fpgabase[FRAME_NO];
	   fifo_enable(); /* enable fifo 
	   //fpgabase[TRIG]=val; /* start count */
	   pl_register_write(fd,TRIG,val);
	   }
	if(val==0){
	   fifo_disable(); /* disable fifo */
	   //fpgabase[TRIG]=val; /* stop count */
	   pl_register_write(fd,TRIG,val);
	   }
    FASTUNLOCK(&fpga_write_lock);
    }
  if(pscal->mode==1){
    FASTLOCK(&fpga_write_lock);
	if(val==1){
	   fifo_disable();/* disable fifo */
	   fifo_reset(); /* reset it */
	   for(i=0;i<zDDM_NCHAN;i++){
	     intens[i]=0;
	     }
	     pscal->runno=fpgabase[FRAME_NO];
	   fifo_enable(); /* enable fifo */
//	   fpgabase[TRIG]=val; /* start count */
	   }
	if(val==0){
	   fifo_disable(); /* disable fifo */
	   //fpgabase[TRIG]=val; /* stop count */
	   pl_register_write(fd,TRIG,val);
	   }
    FASTUNLOCK(&fpga_write_lock);
  
    }
  return(0);
}

/* Abort counting */
STATIC long zDDM_reset(struct zDDMRecord *pscal)
{
unsigned int *mca, *tdc, *spct;
int i,j;
    Debug(2, "scaler_reset(): entry %d\n\r", 1);
    mca=pscal->pmca;
    tdc=pscal->ptdc;
    spct=pscal->pspct; 

    if(pscal->mode==0){
    FASTLOCK(&fpga_write_lock);
    fifo_disable();
    //fpgabase[TRIG]=0;
    pl_register_write(fd,TRIG,0);
    FASTUNLOCK(&fpga_write_lock);
    }
    /* clear monitor spectrum */
    for (i=0; i<4096; i++) {
	       spct[i] = 0;
	       }
    /* clear mca array */
    for (i=0; i<zDDM_NCHAN; i++){
	 for (j=0; j<4096;j++){
	    mca[4096*i+j]=0;
	    }
	}
    /* clear tdc array */
    for (i=0; i<zDDM_NCHAN; i++){
	 for (j=0; j<1024;j++){
	    tdc[1024*i+j]=0;
	    }
	}

    return(0);
}

/* Write timer preset into register */
STATIC long zDDM_write_preset(zDDMRecord *psr, int val)
{
    Debug(2, "scaler_write_preset(): entry, after = %d\n\r", 1); 
    zDDMRecord *pdet = (zDDMRecord *)psr;
    
    pdet->pr1=val;
    FASTLOCK(&fpga_write_lock);
    //fpgabase[COUNT_TIME]=pdet->pr1;
    pl_register_write(fd,COUNT_TIME,pdet->pr1);
    FASTUNLOCK(&fpga_write_lock);
    return(0);
}



/*****************************************************
* VSCSetup()
* User (startup file) calls this function to configure
* us for the hardware.
*****************************************************/
void devzDDMConfig(int num_cards,	/* maximum number of cards in crate */
	   int ndets,		/* Max. no. detectors */
	   unsigned channels)	/* Max. no. channels */
{
/* For NSLS detector this is null, since this is an embedded system
   and only one configuration is possible. */
extern int zDDM_NCHAN, zDDM_NCHIPS;

   if(num_cards != 1){
   	printf("Configure: Illegal number of cards\n");
   }
   if(ndets != 1){
   	printf("Configure: Illegal number of detectors\n");
   }
   if((channels >384)||(channels<32)){
   	printf("Configure: Illegal number of channels\n");
   }
   else {
   	zDDM_NCHAN = channels;
	zDDM_NCHIPS = channels/32;
	}
}

/******************************************************************
* Routines to assemble SPI strings from arrays, and to talk to 
* ASIC via SPI port.
*******************************************************************/
unsigned int reverseBits(int nobits, unsigned int num) 
{  
//	unsigned int reverse_num = 0; 
//	int i; 
//	for (i = 0; i < nobits; i++) 
//	{ 
//		if((num & (1 << i))) 
//		reverse_num |= 1 << ((nobits - 1) - i); 
//	} 
//	return reverse_num;
	return num; 
} 

int wrap(void *pscal){
    int chip, tmp, j, chn;
    int NCHIPS;
    NCHIPS=zDDM_NCHIPS;
    unsigned int tword,tword2;
    for(chip=0;chip<NCHIPS;chip++){
    printf("wrap: NCHIPS=%i chip=%i\n",NCHIPS, chip);
	/* do globals first */
	j=0;
	tword=0;
	tword=globalstr[chip].tm &1;
/*1 */	j++;	
	tword=tword<<1|(globalstr[chip].sbm &1);
/*2 */ 	j++;
	tword=tword<<1|(globalstr[chip].saux &1);
/*3 */	j++;
	tword=tword<<1|(globalstr[chip].sp &1);
/*4 */	j++;
	tword=tword<<1|(globalstr[chip].slh &1);
/*5 */	j++;
	tword=tword<<2|(globalstr[chip].g&3);
/*7 */	j+=2;
	tword=tword<<5|(globalstr[chip].c&0x1f);
/*12 */	j+=5;
	tword=tword<<2|(globalstr[chip].ss&3);
/*14 */	j+=2;
	tword=tword<<2|(globalstr[chip].tr&3);
/*16 */	j+=2;
	tword=tword<<1|(globalstr[chip].sse &1);
/*17 */	j++;
	tword=tword<<1|(globalstr[chip].spur &1);
/*18 */	j++;
	tword=tword<<1|(globalstr[chip].rt &1);
/*19 */	j++;
	tword=tword<<2|(globalstr[chip].ts&3);
/*21 */	j+=2;
	tword=tword<<1|(globalstr[chip].sl &1);
/*22 */	j++;
	tword=tword<<1|(globalstr[chip].sb &1);
/*23 */	j++;
	tword=tword<<1|(globalstr[chip].sbn &1);
/*24 */	j++;
	tword=tword<<1|(globalstr[chip].m1 &1);
/*25 */	j++;
	tword=tword<<1|(globalstr[chip].m0 &1);
/*26 */	j++;
	tword=tword<<1|(globalstr[chip].senfl2 &1);
/*27 */	j++;
	tword=tword<<1|(globalstr[chip].senfl1 &1);
/*28 */	j++;
	tword=tword<<1|(globalstr[chip].rm &1);
/*29 */	j++;
	tmp=globalstr[chip].pb;
	tword=tword<<3|((tmp>>7)&7);
/*32 */	j+=3;
	
	if(devzDDMdebug>5){ printf("# bits=%i   tword=%x\n",j, tword);
	   }
	loads[chip][0]=tword;
	tword2=0;
	j=0;
	tword2=tword2|(tmp & 0x7f);
/*7 */	j+=7;
	tword2=tword2<<10|(globalstr[chip].pa&0x3ff);
/*17 */	j+=10;

	chn=31;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*18 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*19 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*20 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*21 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*24 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*25 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*29 */	j+=4;
	
	chn=30;	
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*30 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*31 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*32 */	j++;

	if(devzDDMdebug>5){ printf("# bits=%i   tword2=%x\n",j, tword2);
	   }
	loads[chip][1]=tword2;
	tword2=0;

	j=0;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*1 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*4 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*5 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*9 */	j+=4;

	chn=29;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*10 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*11 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*12 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*13 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*16 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*17 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*21 */	j+=4;

	chn=28;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*22 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*23 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*24 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*25 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*28 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*29 */	j++;
	tmp=(channelstr[chip*32+chn].dp&15);
	tword2=tword2<<3|((tmp >>1)&7);
/*32 */	j+=3;
	loads[chip][2]=tword2;
	if(devzDDMdebug>5){  printf("# bits=%i   tword2=%x\n",j, tword2);
	}
	tword2=0;
	j=0;
	tword2=tword2|(tmp &0x1);
/*1 */	j++;
	chn=27;

	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*2 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*3 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*4 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*5 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*8 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*9 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*13 */	j+=4;

	chn=26;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*14 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*15 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*16 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*17 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*20 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*21 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*25 */	j+=4;

	chn=25;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*26 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*27 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*28 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*29 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*32 */	j+=3;

	if(devzDDMdebug>5){  printf("# bits=%i   tword2=%x\n",j, tword2);
	  }
	loads[chip][3]=tword2;

	j=0;

	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*1 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*5 */	j+=4;

	chn=24;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*6 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*7 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*8 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*9 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*12 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*13 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*17 */	j+=4;

	chn=23;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*18 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*19 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*20 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*21 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*24 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*25 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*29 */	j+=4;

	chn=22;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*30 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*31 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*32 */	j++;

	if(devzDDMdebug>5){  printf("# bits=%i   tword2=%x\n",j, tword2);
	  }
	loads[chip][4]=tword2;
	tword2=0;
	j=0;

	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*1 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*4 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*5 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*9 */	j+=4;

	chn=21;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*10 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*11 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*12 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*13 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*16 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*17 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*21 */	j+=4;

	chn=20;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*22 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*23 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*24 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*25 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*28 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*29 */	j++;
	tmp=(channelstr[chip*32+chn].dp&15);
	tword2=tword2<<3|(tmp>>1);
/*32 */	j+=3;

	if(devzDDMdebug>5){  printf("# bits=%i   tword2=%x\n",j, tword2);
	  }
	loads[chip][5]=tword2;
	tword2=0;
	j=0;
	tword2=tword2|(tmp&1);
/*1 */	j++;
	chn=19;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*2 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*3 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*4 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*5 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*8 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*9 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*13 */	j+=4;

	chn=18;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*14 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*15 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*16 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*17 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*20 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*21 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*25 */	j+=4;

	chn=17;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*26 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*27 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*28 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*29 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*32 */	j+=3;

	if(devzDDMdebug>5){  printf("# bits=%i   tword2=%x\n",j, tword2);
	  }
	loads[chip][6]=tword2;
	tword2=0;
	j=0;

	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*1 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*5 */	j+=4;

	chn=16;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*6 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*7 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*8 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*9 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*12 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*13 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*17 */	j+=4;

	chn=15;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*18 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*19 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*20 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*21 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*24 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*25 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*29 */	j+=4;
	
	chn=14;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*30 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*31 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*32 */	j++;

	if(devzDDMdebug>5){  printf("# bits=%i   tword2=%x\n",j, tword2);
	  }
	loads[chip][7]=tword2;
	tword2=0;
	j=0;

	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*1 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*4 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*5 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*9 */	j+=4;

	chn=13;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*10 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*11 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*12 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*13 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*16 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*17 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*21 */	j+=4;

	chn=12;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*22 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*23 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*24 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*25 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*28 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*29 */	j++;
	tmp=(channelstr[chip*32+chn].dp&15);
	tword2=tword2<<3|(tmp>>1);
/*32 */	j+=3;

	if(devzDDMdebug>5){  printf("# bits=%i   tword2=%x\n",j, tword2);
	  }
	loads[chip][8]=tword2;
	tword2=0;
	j=0;

	tword2=tword2|(tmp&1);
/*1 */	j+=1;

	chn=11;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*2 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*3 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*4 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*5 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*8 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*9 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*13 */	j+=4;

	chn=10;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*14 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*15 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*16 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*17 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*20 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*21 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*25 */	j+=4;

	chn=9;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*26 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*27 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*28 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*29 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*32 */	j+=3;

	if(devzDDMdebug>5){  printf("# bits=%i   tword2=%x\n",j, tword2);
	  }
	loads[chip][9]=tword2;
	tword2=0;
	j=0;

	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*1 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*5 */	j+=4;
	
	chn=8;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*6 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*7 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*8 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*9 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*12 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*13 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*17 */	j+=4;

	chn=7;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*18 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*19 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*20 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*21 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*24 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*25 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*29 */	j+=4;

	chn=6;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*30 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*31 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*32 */	j++;


	if(devzDDMdebug>5){  printf("# bits=%i   tword2=%x\n",j, tword2);
	  }
	loads[chip][10]=tword2;
	tword2=0;
	j=0;
	
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*1 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*4 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*5 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*9 */	j+=4;


	chn=5;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*10 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*11 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*12 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*13 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*16 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*17 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*21 */	j+=4;

 	chn=4;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*22 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*23 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*24 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*25 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*28 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*29 */	j++;
	tmp=(channelstr[chip*32+chn].dp&15);
	tword2=tword2<<3|(tmp>>1);
/*32 */	j+=3;

 	if(devzDDMdebug>5){  printf("# bits=%i   tword2=%x\n",j, tword2);
	  }
	loads[chip][11]=tword2;
	tword2=0;
	j=0;

	tword2=tword2|(tmp&1);
/*1 */	j++;
	chn=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*2 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*3 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*4 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*5 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*8 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*9 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*13 */	j+=4;

	chn=2;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*14 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*15 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*16 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*17 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*20 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*21 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*25 */	j+=4;

	chn=1;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*26 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*27 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*28 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*29 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*32 */	j+=3;

	if(devzDDMdebug>5){  printf("# bits=%i   tword2=%x\n",j, tword2);
	  }
	loads[chip][12]=tword2;
	tword2=0;
	j=0;

	tword2=tword2|(channelstr[chip*32+chn].nc1&1);
/*1 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*5 */	j+=4;

	chn=0;
	tword2=tword2<<1|(channelstr[chip*32+chn].st&1);
/*6 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sm&1);
/*7 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc2&1);
/*8 */	j++;
	tword2=tword2<<1|(channelstr[chip*32+chn].sel&1);
/*9 */	j++;
	tword2=tword2<<3|(channelstr[chip*32+chn].da&7);
/*12 */	j+=3;
	tword2=tword2<<1|(channelstr[chip*32+chn].nc1&1);
/*13 */	j++;
	tword2=tword2<<4|(channelstr[chip*32+chn].dp&15);
/*17 */	j+=4;
	tword2=tword2<<15;
/*32 */	j+=15;

	if(devzDDMdebug>5){ printf("# bits=%i  chip=%i tword2=%x\n",j, chip, tword2);
	   }
	loads[chip][13]=tword2;
    }
return(0);
}


STATIC long zDDM_done(zDDMRecord *psr)
{
    devPVT *pPvt = (devPVT *)psr->dpvt;
    Debug(2, "scaler_done(): entry, pPvt->done = %d\n\r", pPvt->done);
    if (pPvt->done) {
        pPvt->done = 0;
        return(1);
    } else {
        return(0);
    }
}


void latch_conf(void){
   /* toggle load flag */
   //fpgabase[MARS_CONF_LOAD]=2;
   pl_register_write(fd,MARS_CONF_LOAD,2);
   //fpgabase[MARS_CONF_LOAD]=0;
   pl_register_write(fd,MARS_CONF_LOAD,0);
   
   }
   
   
   
int stuff_mars(void *pscal){ /* stuff structs into chp */
int i, j;

  wrap(pscal); /* set up all bits and regs in loads[][] array */

/* send them out */
FASTLOCK(&fpga_write_lock);

for(i=0;i<12;i++){
//fpgabase[MARS_CONF_LOAD]=4; /* Reset config FIFO */
